---
kind: type
id: T:Autodesk.Revit.DB.SolidGeometryOptions
source: html/0c5062e6-97b3-38c7-9649-27407bca1fbc.htm
---
# Autodesk.Revit.DB.SolidGeometryOptions

A class containing optional information to control the geometry generation of the Solid by the SolidUtils routines.

## Syntax (C#)
```csharp
public class SolidGeometryOptions : IDisposable
```